/* GITErrorObjectParsingFailed (GITCommit:author) */
"Failed to parse author details for commit" = "Failed to parse author details for commit";

/* GITErrorObjectParsingFailed (GITCommit:committer) */
"Failed to parse committer details for commit" = "Failed to parse committer details for commit";

/* GITErrorObjectParsingFailed (GITTree) */
"Failed to parse entry for tree" = "Failed to parse entry for tree";

/* GITErrorObjectParsingFailed (GITTreeEntry) */
"Failed to parse file mode or name for tree entry" = "Failed to parse file mode or name for tree entry";

/* GITErrorObjectParsingFailed (GITCommit:message) */
"Failed to parse message for commit" = "Failed to parse message for commit";

/* GITErrorObjectParsingFailed (GITTag:message) */
"Failed to parse message for tag" = "Failed to parse message for tag";

/* GITErrorObjectParsingFailed (GITTag:tag) */
"Failed to parse name for tag" = "Failed to parse name for tag";

/* GITErrorObjectParsingFailed (GITTag:object) */
"Failed to parse object (commit) reference for tag" = "Failed to parse object (commit) reference for tag";

/* GITErrorObjectParsingFailed (GITTreeEntry:entrySha1) */
"Failed to parse object reference for tree entry" = "Failed to parse object reference for tree entry";

/* GITErrorObjectParsingFailed (GITCommit:parent) */
"Failed to parse parent reference for commit" = "Failed to parse parent reference for commit";

/* GITErrorObjectParsingFailed (GITTag:tagger) */
"Failed to parse tagger for tag" = "Failed to parse tagger for tag";

/* GITErrorObjectParsingFailed (GITCommit:tree) */
"Failed to parse tree reference for commit" = "Failed to parse tree reference for commit";

/* GITErrorPackFileInvalid */
"File %@ is not a PACK file" = "File %@ is not a PACK file";

/* GITErrorFileNotFound (GITPackIndex) */
"File %@ not found" = "File %@ not found";

/* GITErrorObjectStoreNotAccessible (GITFileStore) */
"File store not accessible %@ does not exist or is not a directory" = "File store not accessible %@ does not exist or is not a directory";

/* GITErrorPackIndexCorrupted (GITPackIndexVersion1) */
"Index: %@ : Invalid fanout %lu -> %lu for entry %d" = "Index: %1$@ : Invalid fanout %2$lu -> %3$lu for entry %4$d";

/* GITErrorObjectNotFound */
"Object %@ is not in index file" = "Object %@ is not in index file";

/* GITErrorObjectNotFound */
"Object %@ not found" = "Object %@ not found";

/* GITErrorObjectSizeMismatch */
"Object size mismatch" = "Object size mismatch";

/* GITErrorObjectTypeMismatch */
"Object type mismatch" = "Object type mismatch";

/* GITErrorObjectTypeMismatch (GITObject) */
"Object type mismatch %@ should be %@" = "Object type mismatch %1$@ should be %2$@";

/* GITErrorPackIndexChecksumMismatch */
"PACK Index file checksum failed" = "PACK Index file checksum failed";

/* GITErrorPackIndexUnsupportedVersion */
"Pack Index version %lu is not supported" = "Pack Index version %lu is not supported";

/* GITErrorObjectStoreNotAccessible (GITPackStore:init) */
"PACK store not accessible %@ does not exist or is not a directory" = "PACK store not accessible %@ does not exist or is not a directory";

/* GITErrorObjectStoreNotAccessible (GITPackStore:load) */
"PACK store not accessible, load packs from %@ failed" = "PACK store not accessible, load packs from %@ failed";

/* GITErrorPackFileNotSupported */
"Pack version %lu not supported" = "Pack version %lu not supported";

